In [1]:
import numpy as np
import pandas as pd

In [3]:
s = pd.Series([1,2,3,4,5])  
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
s = pd.Series(['하나', '둘', '셋'])
s

0    하나
1     둘
2     셋
dtype: object

In [5]:
print(type(s))

<class 'pandas.core.series.Series'>

In [9]:
#날짜
dates = pd.date_range('2020-02-10', periods=7)
dates

DatetimeIndex(['2020-02-10', '2020-02-11', '2020-02-12', '2020-02-13',
               '2020-02-14', '2020-02-15', '2020-02-16'],
              dtype='datetime64[ns]', freq='D')

In [17]:
#2차원 배열 자료구조 DataFrame
df = pd.DataFrame(np.random.randn(7,2), index = dates, columns = ['A', 'B'])
df

                   A         B
2020-02-10 -1.429621  0.149896
2020-02-11  0.339618 -1.289087
2020-02-12 -1.309454  0.265653
2020-02-13  0.692549 -0.635990
2020-02-14 -0.465145  0.190742
2020-02-15 -0.050312  0.123842
2020-02-16  0.296435  1.115836

In [18]:
df = pd.DataFrame(np.random.randint(10, 20, size=(7,2)), index = dates, columns = ['A', 'B'])
df

             A   B
2020-02-10  10  19
2020-02-11  16  11
2020-02-12  10  12
2020-02-13  11  16
2020-02-14  10  19
2020-02-15  12  14
2020-02-16  10  14

In [22]:
col = list('가나다라')
df = pd.DataFrame(np.random.randint(1, 100, size=(7, 4)), index = dates, columns = col)
df

             가   나   다   라
2020-02-10  12  13  97  15
2020-02-11  58  78  57   9
2020-02-12  54  68  70   9
2020-02-13  52  57  62  42
2020-02-14  22  22   2  16
2020-02-15  26  73   4  36
2020-02-16  56  31  18  62

In [28]:
df.head(3)

             가   나   다   라
2020-02-10  12  13  97  15
2020-02-11  58  78  57   9
2020-02-12  54  68  70   9

In [29]:
df.tail(4)

             가   나   다   라
2020-02-13  52  57  62  42
2020-02-14  22  22   2  16
2020-02-15  26  73   4  36
2020-02-16  56  31  18  62

In [30]:
df.index

DatetimeIndex(['2020-02-10', '2020-02-11', '2020-02-12', '2020-02-13',
               '2020-02-14', '2020-02-15', '2020-02-16'],
              dtype='datetime64[ns]', freq='D')

In [31]:
df.columns

Index(['가', '나', '다', '라'], dtype='object')

In [36]:
a = df.values
a[1][1]

78

In [37]:
df.T

,2020-02-10,2020-02-11,2020-02-12,2020-02-13,2020-02-14,2020-02-15,2020-02-16
가,12,58,54,52,22,26,56
나,13,78,68,57,22,73,31
다,97,57,70,62,2,4,18
라,15,9,9,42,16,36,62

.T : means Transpose

In [38]:
type(df.columns)

pandas.core.indexes.base.Index

In [39]:
type(df.values)

numpy.ndarray

In [40]:
type(df.index)

pandas.core.indexes.datetimes.DatetimeIndex

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 7 entries, 2020-02-10 to 2020-02-16
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   가       7 non-null      int32
 1   나       7 non-null      int32
 2   다       7 non-null      int32
 3   라       7 non-null      int32
dtypes: int32(4)
memory usage: 168.0 bytes

In [45]:
df.sort_index(axis = 1, ascending = False)

             라   다   나   가
2020-02-10  15  97  13  12
2020-02-11   9  57  78  58
2020-02-12   9  70  68  54
2020-02-13  42  62  57  52
2020-02-14  16   2  22  22
2020-02-15  36   4  73  26
2020-02-16  62  18  31  56

In [46]:
df.describe()

               가          나          다          라
count   7.000000   7.000000   7.000000   7.000000
mean   40.000000  48.857143  44.285714  27.000000
std    19.252705  26.428700  36.554591  20.182501
min    12.000000  13.000000   2.000000   9.000000
25%    24.000000  26.500000  11.000000  12.000000
50%    52.000000  57.000000  57.000000  16.000000
75%    55.000000  70.500000  66.000000  39.000000
max    58.000000  78.000000  97.000000  62.000000

In [53]:
df = pd.DataFrame(np.random.randint(10, 20, size = (7, 4)), columns = list("ABCD"))
df

    A   B   C   D
0  18  11  19  18
1  10  18  18  10
2  16  12  17  13
3  14  11  15  16
4  13  10  16  18
5  17  16  14  12
6  18  17  13  18

In [59]:
df1 = df.sort_values(by='A', ascending = True)

In [60]:
df1

    A   B   C   D
1  10  18  18  10
4  13  10  16  18
3  14  11  15  16
2  16  12  17  13
5  17  16  14  12
0  18  11  19  18
6  18  17  13  18

In [56]:
df['A']

0    18
1    10
2    16
3    14
4    13
5    17
6    18
Name: A, dtype: int32

In [58]:
type(df['B'].values)

numpy.ndarray

In [62]:
df[0:3]

    A   B   C   D
0  18  11  19  18
1  10  18  18  10
2  16  12  17  13

index로 slicing

In [65]:
df.loc[1:6,['A', 'B', 'C']]

    A   B   C
1  10  18  18
2  16  12  17
3  14  11  15
4  13  10  16
5  17  16  14
6  18  17  13

loc로 데이터 뽑아내기 권장 [대괄호 주의]

In [67]:
df

    A   B   C   D
0  18  11  19  18
1  10  18  18  10
2  16  12  17  13
3  14  11  15  16
4  13  10  16  18
5  17  16  14  12
6  18  17  13  18

In [68]:
df.loc[1:5, list("DBA")]

    D   B   A
1  10  18  10
2  13  12  16
3  16  11  14
4  18  10  13
5  12  16  17

In [70]:
df.loc[:,['A']]         # 가장 권장됨
#df['A']
#df.A

    A
0  18
1  10
2  16
3  14
4  13
5  17
6  18

In [71]:
df[df.A > 17]      # 노이즈 제거로 사용가능

    A   B   C   D
0  18  11  19  18
6  18  17  13  18

In [72]:
df.apply(np.cumsum)    # cumulate

     A   B    C    D
0   18  11   19   18
1   28  29   37   28
2   44  41   54   41
3   58  52   69   57
4   71  62   85   75
5   88  78   99   87
6  106  95  112  105

In [73]:
df.apply(lambda x : x.max() - x.min())

A    8
B    8
C    6
D    8
dtype: int64